Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF2680.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D4" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF2A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D40" edc:desc="" edc:mask="0x1" edc:name="TXB2D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D41" edc:desc="" edc:mask="0x1" edc:name="TXB2D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D42" edc:desc="" edc:mask="0x1" edc:name="TXB2D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D43" edc:desc="" edc:mask="0x1" edc:name="TXB2D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D44" edc:desc="" edc:mask="0x1" edc:name="TXB2D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D45" edc:desc="" edc:mask="0x1" edc:name="TXB2D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D46" edc:desc="" edc:mask="0x1" edc:name="TXB2D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D47" edc:desc="" edc:mask="0x1" edc:name="TXB2D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D5" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF2B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D50" edc:desc="" edc:mask="0x1" edc:name="TXB2D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D51" edc:desc="" edc:mask="0x1" edc:name="TXB2D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D52" edc:desc="" edc:mask="0x1" edc:name="TXB2D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D53" edc:desc="" edc:mask="0x1" edc:name="TXB2D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D54" edc:desc="" edc:mask="0x1" edc:name="TXB2D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D55" edc:desc="" edc:mask="0x1" edc:name="TXB2D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D56" edc:desc="" edc:mask="0x1" edc:name="TXB2D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D57" edc:desc="" edc:mask="0x1" edc:name="TXB2D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D6" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF2C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D60" edc:desc="" edc:mask="0x1" edc:name="TXB2D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D61" edc:desc="" edc:mask="0x1" edc:name="TXB2D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D62" edc:desc="" edc:mask="0x1" edc:name="TXB2D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D63" edc:desc="" edc:mask="0x1" edc:name="TXB2D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D64" edc:desc="" edc:mask="0x1" edc:name="TXB2D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D65" edc:desc="" edc:mask="0x1" edc:name="TXB2D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D66" edc:desc="" edc:mask="0x1" edc:name="TXB2D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D67" edc:desc="" edc:mask="0x1" edc:name="TXB2D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2D7" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF2D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D70" edc:desc="" edc:mask="0x1" edc:name="TXB2D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D71" edc:desc="" edc:mask="0x1" edc:name="TXB2D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D72" edc:desc="" edc:mask="0x1" edc:name="TXB2D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D73" edc:desc="" edc:mask="0x1" edc:name="TXB2D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D74" edc:desc="" edc:mask="0x1" edc:name="TXB2D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D75" edc:desc="" edc:mask="0x1" edc:name="TXB2D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D76" edc:desc="" edc:mask="0x1" edc:name="TXB2D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2D77" edc:desc="" edc:mask="0x1" edc:name="TXB2D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CANSTAT_RO3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANSTAT_RO3" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0xF2E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1/ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2/ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3/ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE3" edc:desc="" edc:mask="0x1" edc:name="ICODE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE4" edc:desc="" edc:mask="0x1" edc:name="ICODE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnsnnnr" edc:cname="CANCON_RO3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANCON_RO3" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0xF2F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0/FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1/FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2/FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP0" edc:desc="" edc:mask="0x1" edc:name="REQOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP1" edc:desc="" edc:mask="0x1" edc:name="REQOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP2" edc:desc="" edc:mask="0x1" edc:name="REQOP2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WIN0" edc:desc="" edc:mask="0x1" edc:name="WIN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1" edc:desc="" edc:mask="0x1" edc:name="WIN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2" edc:desc="" edc:mask="0x1" edc:name="WIN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="crrrn-nn" edc:cname="TXB1CON" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TXB1CON" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xF30">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXPRI0" edc:desc="" edc:mask="0x1" edc:name="TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXPRI1" edc:desc="" edc:mask="0x1" edc:name="TXPRI1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXABT" edc:desc="" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBIF" edc:desc="" edc:mask="0x1" edc:name="TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="TXBIFTXB1CON" edc:desc="" edc:mask="0x1" edc:name="TXBIFTXB1CON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB1PRI0" edc:desc="" edc:mask="0x1" edc:name="TXB1PRI0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1PRI1" edc:desc="" edc:mask="0x1" edc:name="TXB1PRI1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1REQ" edc:desc="" edc:mask="0x1" edc:name="TXB1REQ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1ERR" edc:desc="" edc:mask="0x1" edc:name="TXB1ERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1LARB" edc:desc="" edc:mask="0x1" edc:name="TXB1LARB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1ABT" edc:desc="" edc:mask="0x1" edc:name="TXB1ABT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX1IF" edc:desc="" edc:mask="0x1" edc:name="TX1IF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB1SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB1SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF31">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB1SID3" edc:desc="" edc:mask="0x1" edc:name="TXB1SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1SID4" edc:desc="" edc:mask="0x1" edc:name="TXB1SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1SID5" edc:desc="" edc:mask="0x1" edc:name="TXB1SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1SID6" edc:desc="" edc:mask="0x1" edc:name="TXB1SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1SID7" edc:desc="" edc:mask="0x1" edc:name="TXB1SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1SID8" edc:desc="" edc:mask="0x1" edc:name="TXB1SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1SID9" edc:desc="" edc:mask="0x1" edc:name="TXB1SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1SID10" edc:desc="" edc:mask="0x1" edc:name="TXB1SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="TXB1SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="TXB1SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx" edc:_addr="0xF32">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB1EID16" edc:desc="" edc:mask="0x1" edc:name="TXB1EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID17" edc:desc="" edc:mask="0x1" edc:name="TXB1EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1EXIDE" edc:desc="" edc:mask="0x1" edc:name="TXB1EXIDE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1SID0" edc:desc="" edc:mask="0x1" edc:name="TXB1SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1SID1" edc:desc="" edc:mask="0x1" edc:name="TXB1SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1SID2" edc:desc="" edc:mask="0x1" edc:name="TXB1SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB1EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB1EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF33">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB1EID8" edc:desc="" edc:mask="0x1" edc:name="TXB1EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID9" edc:desc="" edc:mask="0x1" edc:name="TXB1EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID10" edc:desc="" edc:mask="0x1" edc:name="TXB1EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID11" edc:desc="" edc:mask="0x1" edc:name="TXB1EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID12" edc:desc="" edc:mask="0x1" edc:name="TXB1EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID13" edc:desc="" edc:mask="0x1" edc:name="TXB1EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID14" edc:desc="" edc:mask="0x1" edc:name="TXB1EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID15" edc:desc="" edc:mask="0x1" edc:name="TXB1EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB1EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB1EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF34">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB1EID0" edc:desc="" edc:mask="0x1" edc:name="TXB1EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID1" edc:desc="" edc:mask="0x1" edc:name="TXB1EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID2" edc:desc="" edc:mask="0x1" edc:name="TXB1EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID3" edc:desc="" edc:mask="0x1" edc:name="TXB1EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID4" edc:desc="" edc:mask="0x1" edc:name="TXB1EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID5" edc:desc="" edc:mask="0x1" edc:name="TXB1EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID6" edc:desc="" edc:mask="0x1" edc:name="TXB1EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1EID7" edc:desc="" edc:mask="0x1" edc:name="TXB1EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-n--nnnn" edc:cname="TXB1DLC" edc:desc="" edc:impl="0x4f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-u--uuuu" edc:name="TXB1DLC" edc:nzwidth="0x8" edc:por="-x--xxxx" edc:_addr="0xF35">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TXRTR" edc:desc="" edc:mask="0x1" edc:name="TXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB1DLC0" edc:desc="" edc:mask="0x1" edc:name="TXB1DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1DLC1" edc:desc="" edc:mask="0x1" edc:name="TXB1DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1DLC2" edc:desc="" edc:mask="0x1" edc:name="TXB1DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1DLC3" edc:desc="" edc:mask="0x1" edc:name="TXB1DLC3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TXB1RTR" edc:desc="" edc:mask="0x1" edc:name="TXB1RTR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
