Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF2680.PIC
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D6" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF6C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D60" edc:desc="" edc:mask="0x1" edc:name="RXB0D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D61" edc:desc="" edc:mask="0x1" edc:name="RXB0D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D62" edc:desc="" edc:mask="0x1" edc:name="RXB0D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D63" edc:desc="" edc:mask="0x1" edc:name="RXB0D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D64" edc:desc="" edc:mask="0x1" edc:name="RXB0D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D65" edc:desc="" edc:mask="0x1" edc:name="RXB0D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D66" edc:desc="" edc:mask="0x1" edc:name="RXB0D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D67" edc:desc="" edc:mask="0x1" edc:name="RXB0D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D7" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF6D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D70" edc:desc="" edc:mask="0x1" edc:name="RXB0D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D71" edc:desc="" edc:mask="0x1" edc:name="RXB0D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D72" edc:desc="" edc:mask="0x1" edc:name="RXB0D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D73" edc:desc="" edc:mask="0x1" edc:name="RXB0D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D74" edc:desc="" edc:mask="0x1" edc:name="RXB0D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D75" edc:desc="" edc:mask="0x1" edc:name="RXB0D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D76" edc:desc="" edc:mask="0x1" edc:name="RXB0D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0D77" edc:desc="" edc:mask="0x1" edc:name="RXB0D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CANSTAT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANSTAT" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0xF6E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1/ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2/ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3/ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE3" edc:desc="" edc:mask="0x1" edc:name="ICODE3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3" edc:desc="" edc:mask="0x1" edc:name="EICODE3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnsnnnr" edc:cname="CANCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANCON" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0xF6F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0/FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1/FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2/FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP0" edc:desc="" edc:mask="0x1" edc:name="REQOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP1" edc:desc="" edc:mask="0x1" edc:name="REQOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP2" edc:desc="" edc:mask="0x1" edc:name="REQOP2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WIN0" edc:desc="" edc:mask="0x1" edc:name="WIN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1" edc:desc="" edc:mask="0x1" edc:name="WIN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2" edc:desc="" edc:mask="0x1" edc:name="WIN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FP1" edc:desc="" edc:mask="0x1" edc:name="FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FP2" edc:desc="" edc:mask="0x1" edc:name="FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FP3" edc:desc="" edc:mask="0x1" edc:name="FP3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
